Конфигурация/DataProcessors/RemainsOfMoney.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>RemainsOfMoney</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/AccumulationRegisters/Cash.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Cash</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Sum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Expenditure</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Expenditures</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Wallet</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Wallets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/DataProcessors/RemainsOfMoney/Forms/Form/Ext/Form/Module.bsl
&AtServer
Procedure RefreshBalance()
	RemainsOfMoney.Clear();
	VTable    = AccumulationRegisters.Cash.Balance();
	VTable.Sort("Wallet");
	Column = VTable.Columns.Add("Currency");
	Totals = 0;
	For Each TableRow In VTable Do
		NewRow = RemainsOfMoney.Add();
		TableRow.Currency = TableRow.Wallet.Currency;
		FillPropertyValues(NewRow,TableRow);
	EndDo;	
	
	VTable.GroupBy("Currency","Sum");
	VTable.Sort("Currency");
	Totals = "";
	For Each TableRow In VTable Do
		IF TableRow.Sum <> 0 Then
			Totals = Totals + ?(IsBlankString(Totals),"","; ") + Format(TableRow.Sum,"NFD=; NG=") + " " + ?(ValueIsFilled(TableRow.Currency),TableRow.Currency,"<>");
		EndIf;	
	EndDo;	
EndProcedure	

&AtClient
Procedure CommandRefreshBalanceДС(Command)
	RefreshBalance();
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	RefreshBalance();
EndProcedure

&AtClient
Procedure BalanceChoice(Item, RowSelected, Field, StandardProcessing)
	CurRow = Items.Balance.CurrentData;
	IF CurRow <> Undefined Then
		OpenForm("DataProcessor.TransactionsJournal.Form.Form",New Structure("Wallet",CurRow.Wallet));
	EndIf;	
EndProcedure
